modules/News/Controllers/CheapController.php

  public function tripNew(Request $request, $city = ''){
    $currency = Session::get('currency', 'CAD');
    $selectedCurrency = $request->query('currency', $currency);

    if ($currency === '' || $selectedCurrency !== $currency) {
        session('currency', $selectedCurrency, time() + (86400 * 30), "/");
        Session::put(['currency' => $selectedCurrency]);
    } else {
        $selectedCurrency = $currency;
    }


    $cities = DB::table('bravo_return_filght_city')->get();
    // dd($cities);
    // die;
    $cityDetails = null;
    $city = str_replace("-"," ",$city);

    if ($city) {
        $cityDetails = DB::table('bravo_return_filght_city')
                          ->where('city', $city)
                          ->first();
---
select * from `bravo_return_filght_city`
select * from `bravo_return_filght_city` where `city` = 'Alberta' limit 1