modules/Flight/Controllers/SubscriptionController.php

select exists(select * from `subscriptions` where `ip_address` = '27.0.169.104') as `exists`
---
public function checkIp(Request $request) {
    // Get the IP address of the client
    $serverIpAddress = $request->ip();

    // Check if the IP address exists in the Subscription table
    $ipExists = Subscription::where('ip_address', $serverIpAddress)->exists();